app/controllers/topics_controller.rb

  def index
    @topics = Topic.all
---
SELECT * FROM "topics"

  def show
    @topic = Topic.find(params[:id])
---
SELECT * FROM "topics" WHERE ("topics"."id" = 1)

  def edit
    @topic = Topic.find(params[:id])
---
SELECT * FROM "topics" WHERE ("topics"."id" = 1)

  def create
    @topic = Topic.new(params[:topic])

    respond_to do |format|
      if @topic.save
---
INSERT INTO "topics" ("created_at", "title", "updated_at", "description") VALUES('2009-06-18 05:59:35', 'Rails 2.3 update!', '2009-06-18 05:59:35', 'application.rb is now call application_controller.rb

  def update
    @topic = Topic.find(params[:id])

    respond_to do |format|
      if @topic.update_attributes(params[:topic])
---
SELECT * FROM "topics" WHERE ("topics"."id" = 2)
UPDATE "topics" SET "updated_at" = '2009-06-18 19:08:41', "description" = 't2 content Shares of major banks rose Thursday as Treasury Secretary Timothy Geithner appeared before a Congressional panel defending the regulatory overhaul announced the day before by President Barack Obama. Geithner said he''s seen evidence of healing in the financial sector. Several positive reports on the economy encouraged investors after a sell-off in stocks earlier this week that dragged the benchmark Standard & Poor''s 500 index down 3.8 percent.' WHERE "id" = 2

  def destroy
    @topic = Topic.find(params[:id])
    @topic.destroy
---
SELECT * FROM "topics" WHERE ("topics"."id" = 1)
DELETE FROM "topics" WHERE "id" = 1

  def show_description

     @description = Topic.find(params[:id]).description
---
SELECT * FROM "topics" WHERE ("topics"."id" = 3)