app/controllers/votes_controller.rb

SELECT * FROM "topics" WHERE ("topics"."id" = 1)
INSERT INTO "votes" ("created_at", "updated_at", "user_id", "topic_id") VALUES('2009-06-18 23:44:50', '2009-06-18 23:44:50', 1, 7)
---
   def create
    @topic = Topic.find(params[:topic_id])
    @vote = @topic.votes.create!